// Создайте новый элемент изображения (img) и установите ему атрибут src с ссылкой на изображение. Далее добавьте это изображение на вашу веб-страницу. Изображение может быть любым.
const img = document.createElement('img')
img.setAttribute('src', '')

// Используя метод insertAdjacentHTML, создайте новый заголовок второго уровня (h2) с текстом "Дополнительный заголовок" 
// и вставьте его перед существующим заголовком первого уровня (h1) внутри элемента с идентификатором "headerContainer".

const h2=